MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx575f256l.h
extern volatile __C1FIFOCI9bits_t C1FIFOCI9bits __asm__ ("C1FIFOCI9") __attribute__((section("sfrs"), address(0xBF88B5C0)));
extern volatile uint32_t        C1FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF88B5C4)));
extern volatile uint32_t        C1FIFOCI9SET __attribute__((section("sfrs"),address(0xBF88B5C8)));
extern volatile uint32_t        C1FIFOCI9INV __attribute__((section("sfrs"),address(0xBF88B5CC)));
#define C1FIFOCON10 C1FIFOCON10
extern volatile uint32_t   C1FIFOCON10 __attribute__((section("sfrs"), address(0xBF88B5D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON10bits_t;
extern volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs"), address(0xBF88B5D0)));
extern volatile uint32_t        C1FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF88B5D4)));
extern volatile uint32_t        C1FIFOCON10SET __attribute__((section("sfrs"),address(0xBF88B5D8)));
extern volatile uint32_t        C1FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88B5DC)));
#define C1FIFOINT10 C1FIFOINT10
extern volatile uint32_t   C1FIFOINT10 __attribute__((section("sfrs"), address(0xBF88B5E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT10bits_t;
extern volatile __C1FIFOINT10bits_t C1FIFOINT10bits __asm__ ("C1FIFOINT10") __attribute__((section("sfrs"), address(0xBF88B5E0)));
extern volatile uint32_t        C1FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF88B5E4)));
extern volatile uint32_t        C1FIFOINT10SET __attribute__((section("sfrs"),address(0xBF88B5E8)));
extern volatile uint32_t        C1FIFOINT10INV __attribute__((section("sfrs"),address(0xBF88B5EC)));
#define C1FIFOUA10 C1FIFOUA10
extern volatile uint32_t   C1FIFOUA10 __attribute__((section("sfrs"), address(0xBF88B5F0)));
extern volatile uint32_t        C1FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF88B5F4)));
extern volatile uint32_t        C1FIFOUA10SET __attribute__((section("sfrs"),address(0xBF88B5F8)));
extern volatile uint32_t        C1FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88B5FC)));
#define C1FIFOCI10 C1FIFOCI10
extern volatile uint32_t   C1FIFOCI10 __attribute__((section("sfrs"), address(0xBF88B600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI10bits_t;
extern volatile __C1FIFOCI10bits_t C1FIFOCI10bits __asm__ ("C1FIFOCI10") __attribute__((section("sfrs"), address(0xBF88B600)));
extern volatile uint32_t        C1FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF88B604)));
extern volatile uint32_t        C1FIFOCI10SET __attribute__((section("sfrs"),address(0xBF88B608)));
extern volatile uint32_t        C1FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88B60C)));
#define C1FIFOCON11 C1FIFOCON11
extern volatile uint32_t   C1FIFOCON11 __attribute__((section("sfrs"), address(0xBF88B610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON11bits_t;
extern volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs"), address(0xBF88B610)));
extern volatile uint32_t        C1FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF88B614)));
extern volatile uint32_t        C1FIFOCON11SET __attribute__((section("sfrs"),address(0xBF88B618)));
extern volatile uint32_t        C1FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88B61C)));
#define C1FIFOINT11 C1FIFOINT11
extern volatile uint32_t   C1FIFOINT11 __attribute__((section("sfrs"), address(0xBF88B620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT11bits_t;
extern volatile __C1FIFOINT11bits_t C1FIFOINT11bits __asm__ ("C1FIFOINT11") __attribute__((section("sfrs"), address(0xBF88B620)));
extern volatile uint32_t        C1FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF88B624)));
extern volatile uint32_t        C1FIFOINT11SET __attribute__((section("sfrs"),address(0xBF88B628)));
extern volatile uint32_t        C1FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88B62C)));
#define C1FIFOUA11 C1FIFOUA11
extern volatile uint32_t   C1FIFOUA11 __attribute__((section("sfrs"), address(0xBF88B630)));
extern volatile uint32_t        C1FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF88B634)));
extern volatile uint32_t        C1FIFOUA11SET __attribute__((section("sfrs"),address(0xBF88B638)));
extern volatile uint32_t        C1FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88B63C)));
#define C1FIFOCI11 C1FIFOCI11
extern volatile uint32_t   C1FIFOCI11 __attribute__((section("sfrs"), address(0xBF88B640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI11bits_t;
